# US - Baby Names

### Introduction:

We are going to use a subset of [US Baby Names](https://www.kaggle.com/kaggle/us-baby-names) from Kaggle.  
In the file it will be names from 2004 until 2014


### Step 1. Import the necessary libraries

In [2]:
import pandas as pd

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv).

### Step 3. Assign it to a variable called baby_names.

In [3]:
baby_names = pd.read_csv("https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv")

### Step 4. See the first 10 entries

In [16]:
baby_names.head(10)

      Id      Name  Year Gender State  Count
0  11350      Emma  2004      F    AK     62
1  11351   Madison  2004      F    AK     48
2  11352    Hannah  2004      F    AK     46
3  11353     Grace  2004      F    AK     44
4  11354     Emily  2004      F    AK     41
5  11355   Abigail  2004      F    AK     37
6  11356    Olivia  2004      F    AK     33
7  11357  Isabella  2004      F    AK     30
8  11358    Alyssa  2004      F    AK     29
9  11359    Sophia  2004      F    AK     28

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [5]:
baby_names = baby_names.iloc[:, 1:]
baby_names.head(10)

      Id      Name  Year Gender State  Count
0  11350      Emma  2004      F    AK     62
1  11351   Madison  2004      F    AK     48
2  11352    Hannah  2004      F    AK     46
3  11353     Grace  2004      F    AK     44
4  11354     Emily  2004      F    AK     41
5  11355   Abigail  2004      F    AK     37
6  11356    Olivia  2004      F    AK     33
7  11357  Isabella  2004      F    AK     30
8  11358    Alyssa  2004      F    AK     29
9  11359    Sophia  2004      F    AK     28

### Step 6. Is there more male or female names in the dataset?

In [6]:
baby_names["Gender"].value_counts()

Gender
F    558846
M    457549
Name: count, dtype: int64

### Step 7. Group the dataset by name and assign to names

In [7]:
names = baby_names.groupby("Name").size().sort_values(ascending=False)

### Step 8. How many different names exist in the dataset?

In [8]:
names.shape[0]

17632

### Step 9. What is the name with most occurrences?

In [24]:
names.head(1)

Name
Riley    1112
dtype: int64

### Step 10. How many different names have the least occurrences?

In [37]:
min_occurence = names.value_counts().min()
mask = names.value_counts() == min_occurence
mask

len(names[names == min_occurence])

3682

### Step 11. What is the median name occurrence?

In [40]:
names[names == names.median()]

Name
Mycah      8
Ramone     8
Ram        8
Alyn       8
Ambree     8
          ..
Yunuen     8
Jazmynn    8
Dagan      8
Jeilyn     8
Jian       8
Length: 360, dtype: int64

### Step 12. What is the standard deviation of names?

In [41]:
names.std()

np.float64(122.0299635081389)

### Step 13. Get a summary with the mean, min, max, std and quartiles.

In [42]:
names.describe()

count    17632.000000
mean        57.644907
std        122.029964
min          1.000000
25%          2.000000
50%          8.000000
75%         39.000000
max       1112.000000
dtype: float64